#pragma once

#include <QString>
#include <QDebug>
#include <QRegularExpression>
#include <vector>

#include "../common/utils.h"
#include "../common/consts.h"

namespace Algorithm
{

struct Permutation
{
private:

    static void makePermutation(QString& text, const QStringList& permutation);

    static QString makeEncode(const std::vector<QString>& table, const QStringList& permuationTable);

    static QString makeDecode(const std::vector<QString>& table, const QStringList& permuationTable);

    static std::vector<QString> makeEncodeTable(const QString& text, const int& size, const int& chanSize);

    static std::vector<QString> makeDecodeTable(const QString& text, const int& keyLegth, const QStringList& key);

    static Description::Description m_description;

public:
    static ReturnType encode(const QString& text, const QString& key);

    static ReturnType decode(const QString& text, const QString& key);

    static QString generateKey();

    static bool validate(const QString& , const QString&);

    static QString theory()
    {
        return "Шифр перестановки - це метод симетричного шифрування, в якому елементи вихідного відкритого тексту міняють місцями. Елементами тексту можуть бути окремі символи (найпоширеніший випадок), пари букв, трійки букв, комбінування цих випадків і так далі. Типовими прикладами перестановки є анаграми. У класичній криптографії шифри перестановки можна розділити на два класи: • Шифри одинарної (простий) перестановки - при шифруванні символи відкритого тексту переміщаються з вихідних позицій в нові один раз. • Шифри множинної (складної) перестановки - при шифруванні символи відкритого тексту переміщаються з вихідних позицій в нові кілька разів. В якості альтернативи шифрів перестановки можна розглядати підстановочні шифри. У них елементи тексту не змінюють свою послідовність, а змінюються самі. Шифри простої перестановки Як правило, при шифрування і дешифрування шифру простої перестановки використовується таблиця перестановок. Перший рядок - позиція символу e відкритому тексті, другий рядок - позиція в шифрограмі. Таким чином, при довжині повідомлення n символів існує рівно n! ключів. Шифри маршрутної перестановки Широке поширення отримали так звані маршрутні перестановки, які використовують деяку геометричну фігуру (плоску або об'ємну). Перетворення полягають у тому, що відрізок відкритого тексту записується в таку фігуру за деякою траєкторією, а виписується по іншій траєкторії. Приклад даного шифру - шифр Скіталу. Шифр табличній маршрутної перестановки Найбільшого поширення набули маршрутні шифри перестановки, засновані на прямокутниках (таблицях). Наприклад, можна записати повідомлення в прямокутну таблицю по маршруту: по горизонталі, починаючи з верхнього лівого кута, по черзі зліва направо. Повідомлення будемо списувати за маршрутом: по вертикалях, починаючи з верхнього правого кута, по черзі зверху вниз. Шифр вертикальної перестановки Широке поширення отримала різновид маршрутної перестановки - вертикальна перестановка. У цьому шифрі також використовується прямокутна таблиця, в яку повідомлення записується по рядках зліва направо. Виписується шифрограма по вертикалях, при цьому стовпці вибираються в порядку, визначеному ключем. Шифр «поворотна решітка» Решітка Кардано У 1550 році італійський математик Джироламо Кардано (1501-1576) в книзі «Про тонкощі» запропонував нову техніку шифрування повідомлень - грати. Спочатку решітка Кардано представляла собою трафарет з отворами, в які записували букви, склади або слова повідомлення. Потім трафарет прибирали, а вільне місце заповнювали більш-менш осмисленим текстом. Такий метод приховування інформації відноситься до стеганографії. Пізніше був запропонований шифр «поворотна решітка» - перший транспозіціонний (геометричний) шифр. Незважаючи на те, що існує велика різниця між початковим пропозицією Кардано і шифром «поворотна решітка», методи шифрування, засновані на трафаретах, прийнято називати «гратами Кардано». Чотири позіції решітки Для шифрування і дешифрування за допомогою даного шифру виготовляється трафарет з вирізаними отворами. При накладенні трафарету на таблицю того ж розміру чотирма можливими способами, його вирізи повністю повинні покривати всі клітини таблиці рівно по одному разу. При шифруванні трафарет накладають на таблицю. В видимі осередки по певному маршруту вписують літери відкритого тексту. Далі трафарет перевертають три рази, кожен раз роблячи операцію заповнення. Шифрограму виписують з отриманої таблиці по певному маршруту. Ключем є трафарет, маршрут вписування і порядок поворотів. Шифри складної перестановки В даному класі шифрів перестановки використовується ідея багаторазової перестановки символів або повторного шифрування вже зашифрованого повідомлення. Шифр подвійний перестановки При шифруванні шифром подвійної перестановки в таблицю за певним маршрутом записується текст, потім переставляються стовпці і рядки. Далі по певному маршруту виписується шифрограма. Ключем до шифру є розмір таблиці, маршрути вписування і виписування, порядки перестановки стовпців і рядків. Якщо маршрути є фіксованими величинами, то кількість ключів одно n! m !, де n і m - кількість рядків і стовпців в таблиці. Криптоаналіз При дешифрування тексту використовують частотні характеристики відкритого тексту. Однак для отримання стійкої картини довжина послання має бути істотно більше ключа. Однією з найбільш стійких характеристик осмисленого тексту є відсутність заборонених биграмм (пара сусідніх букв). Наприклад, біграми «Комерсант + Ь», «голосна + Ь», «пробіл + Ь». Знання і використання частотної діаграми відкритого тексту значно спростить дешифрування шифру перестановки ";
    }
};

} // namespace Algorithm
