#pragma once
#include <QString>
#include <array>
#include <map>
#include <algorithm>
#include <QDebug>

#include "../common/consts.h"
#include "../common/utils.h"

namespace Algorithm
{

class Vigenere
{
    using TableType = std::array<QString, UKRAINIAN_ALPHABET_SIZE>;

    static TableType fillTable();

    static std::pair<int, int> getIndexs(const QChar& textChar, const QChar& keyChar);

    static Description::Description m_description;

    static void createTableDescription(const TableType& table);

public:
    static ReturnType encode(const QString& text, const QString& key);

    static ReturnType decode(const QString& text, const QString& key);

    static QString generateKey();

    static bool validate(const QString&, const QString&);

    static QString theory()
    {
        return "Шифр Віженера (фр. Chiffre de Vigenère) - метод поліалфавітного шифрування літерного тексту з використанням ключового слова.ОписУ шифрі Цезаря кожна буква алфавіту зсувається на кілька позицій; наприклад в шифрі Цезаря при зсуві +3, A стало б D, B стало б E і так далі. ШифрВіженера складається з послідовності декількох шифрів Цезаря з різними значеннями зсуву. Для зашифровування може використовуватися таблиця алфавітів,названа tabula recta або квадрат (таблиця) Віженера. Стосовно до латинському алфавіту таблиця Віженера складається з рядків по 26 символів, причомукожний наступний рядок зсувається на кілька позицій. Таким чином, в таблиці виходить 26 різних шифрів Цезаря. На кожному етапі шифруваннявикористовуються різні алфавіти, які обираються в залежності від символу ключового слова. Наприклад, припустимо, що вихідний текст має такий вигляд:ATTACKATDAWNЛюдина, яка посилає повідомлення, записує ключове слово ( «LEMON») циклічно доти, поки його довжина не буде відповідати довжині вихідного тексту:LEMONLEMONLEПерший символ вихідного тексту A зашифрований послідовністю L, яка є першим символом ключа. Перший символ L шифрованого тексту знаходиться на перетинірядка L і стовпці A в таблиці Віженера. Точно так же для другого символу вихідного тексту використовується другий символ ключа; тобто другий символшифрованого тексту X виходить на перетині рядка E і стовпці T. Інша частина вихідного тексту шифрується подібним способом.Розшифрування проводиться таким чином: знаходимо в таблиці Віженера рядок, відповідну першому символу ключового слова; в цьому рядку знаходимо першийсимвол зашифрованого тексту. Стовпець, в якому знаходиться даний символ, відповідає першому символу вихідного тексту.КриптоаналізШифр Віженера «розмиває» характеристики частот появи символів у тексті, але деякі особливості появи символів в тексті залишаються. Головний недолікшифру Віженера полягає в тому, що його ключ повторюється. Тому простий криптоаналіз шифру може бути побудований в два етапи:1. Пошук довжини ключа. Можна аналізувати розподіл частот в зашифрованому тексті з різним проріджуванням. Тобто брати текст, що включає кожну 2-у буквузашифрованого тексту, потім кожну 3-ю і т. д. Як тільки розподіл частот букв буде сильно відрізнятися від рівномірного (наприклад, по ентропії), томожна говорити про знайдену довжині ключа.2. Криптоаналіз. Сукупність l шифрів Цезаря (де l - знайдена довжина ключа), які окремо легко зламуються.Тести Фрідмана і Касіскі можуть допомогти визначити довжину ключ";
    }

};

} // namespace Algorithm

