import QtQuick 2.0
import QtQuick.Controls 2.15 as Controls2
import QtQuick.Controls 1.4 as Controls1
import QtQuick.Controls.Styles 1.4
import QtQuick.Layouts 1.15

Rectangle {
    property var trigger
//    property string text: "asd"
    id: _root

    function createModel(count) {
        var items = []
        const prefix = "Drag image "
        for(var i = 0; i < count; ++i)
            items.push(prefix + (i+1))
        return items
    }

    Loader {
        id: _loader
    }


    Component {
        id: _theory

        TheoryWindow {
            width: 600
            height: 400
            text: " Стеганогра́фія — (з грец. στεγανός — прихований + γράφω — пишу) — тайнопис, при якому повідомлення, закодоване таким чином, що не виглядає як повідомлення — на відміну від криптографії. Таким чином непосвячена людина принципово не може розшифрувати повідомлення — бо не знає про факт його існування. Якщо криптографія приховує зміст повідомлення, то стеганографія приховує сам факт існування повідомлення. Методи Розглядаючи програмні засоби захисту, доцільно спинитись на стеганографічних методах. Слово «стеганографія» означає приховане письмо, яке не дає можливості сторонній особі дізнатися про його існування. Одна з перших згадок про застосування тайнопису датується V століттям до н. е. Сучасним прикладом є випадок роздрукування на ЕОМ контрактів з малопомітними викривленнями обрисів окремих символів тексту — так вносилась шифрована інформація про умови складання контракту. Комп'ютерна стеганографія базується на двох принципах. По-перше, аудіо- і відеофайли, а також файли з оцифрованими зображеннями можна деякою мірою змінити без втрати функціональності. По-друге, можливості людини розрізняти дрібні зміни кольору або звуку обмежені. Методи стеганографії дають можливість замінити несуттєві частки даних на конфіденційну інформацію. Сімейна цифрова фотографія може містити комерційну інформацію, а файл із записом сонати Гайдна — приватний лист. Але найчастіше стеганографія використовується для створення цифрових водяних знаків. На відміну від звичайних їх можна нанести і відшукати тільки за допомогою спеціального програмного забезпечення — цифрові водяні знаки записуються як псевдовипадкові послідовності шумових сигналів, згенерованих на основі секретних ключів. Такі знаки можуть забезпечити автентичність або недоторканість документа, ідентифікувати автора або власника, перевірити права дистриб'ютора або користувача, навіть якщо файл був оброблений або спотворений. Щодо впровадження засобів програмно-технічного захисту в ІС, розрізняють два основні його способи: додатковий захист — засоби захисту є доповненням до основних програмних і апаратних засобів комп'ютерної системи; вбудований захист — механізми захисту реалізуються у вигляді окремих компонентів ІС або розподілені за іншими компонентами системи. Перший спосіб є гнучкішим, його механізми можна додавати і вилучати за потребою, але під час його реалізації можуть постати проблеми забезпечення сумісності засобів захисту між собою та з програмно-технічним комплексом ІС. Вмонтований захист вважається більш надійним і оптимальним, але є жорстким, оскільки в нього важко внести зміни. Таким доповненням характеристик способів захисту зумовлюється те, що в реальній системі їх комбінують. Класифікація стеганографії Наприкінці 90-х років виділилося кілька напрямків стеганографії: Класична стеганографія Комп'ютерна стеганографія Цифрова стеганографія Класична Одним з найпоширеніших методів класичної стеганографії є використання симпатичних чорнил (невидимих). Зазвичай процес запису здійснюється наступним чином: перший шар — наноситься важливий запис невидимим чорнилом, другий шар — запис видимими чорнилом, що нічого не значить. Текст, записаний такими чорнилом, проявляється лише за певних умов (нагрівання, освітлення, хімічний проявник і т. д.). Винайдені ще в I столітті н. е. Філоном Александрійським, ними користувались як в середньовіччі, так і в новітній час, наприклад, у листах революціонерів з російських в'язниць. Написаний звичайним молоком текст на папері між рядків видимого тексту, проявляється при нагріванні над полум'ям (зазвичай свічки). Існує також чорнило з хімічно нестабільним пігментом. Написане цими чорнилами виглядає як написане звичайною ручкою, але через певний час нестабільний пігмент розкладається, і від тексту не залишається і сліду. Хоча при використанні звичайної кулькової ручки текст можливо відновити по деформації паперу, цей недолік можна усунути за допомогою м'якого пишучого вузла, на зразок фломастера. Симпатичними чорнилами можуть слугувати найрізноманітніші речовини: лимонна кислота, віск, яблучний сік, молоко, сік цибулі, слина, пральний порошок, аспірин, крохмаль з різними хімічними чи фізичними «декодерами»: температура, сода, йод, солі, заліза, ультрафіолетове світло, для воску навіть крейда чи зубний порошок. Комп'ютерна стеганографія Комп'ютерна стеганографія — напрям класичної стеганографії, заснований на особливостях комп'ютерної платформи. Приклади — стеганографічна файлова система StegFS для Linux, приховування даних в невикористовуваних областях форматів файлів, підміна символів в назвах файлів, текстова стеганографія і т. д. Наведемо деякі приклади: Використання зарезервованих полів комп'ютерних форматів файлів — суть методу полягає в тому, що частина поля розширень, не заповнена інформацією про розширення, за замовчуванням заповнюється нулями. Відповідно ми можемо використовувати цю «нульову» частину для запису своїх даних. Недоліком цього методу є низький ступінь скритності і малий обсяг переданої інформації. Метод приховування інформації в невикористовуваних місцях гнучких дисків — при використанні цього методу інформація записується в невживані частини диска, наприклад, на нульову доріжку. Недоліки: маленька продуктивність, передача невеликих за обсягом повідомлень. Метод використання особливих властивостей полів форматів, які не відображаються на екрані — цей метод ґрунтується на спеціальних «невидимих» полях для отримання виносок, покажчиків. До прикладу, написання чорним шрифтом на чорному тлі. Недоліки: маленька продуктивність, невеликий обсяг переданої інформації. Використання особливостей файлових систем — при зберіганні на жорсткому диску файл завжди (не рахуючи деяких ФС, наприклад, ReiserFS) займає ціле число кластерів (мінімальних адресуються обсягів інформації). До прикладу, в раніше широко використовуваної файлової системи FAT32 (використовувалася в Windows98/Me/2000) стандартний розмір кластера — 4 Кб. Відповідно для зберігання 1 Кб інформації на диску виділяється 4 Кб інформації, з яких 1Кб потрібен для зберігання файлу,, а інші 3 ні на що не використовуються — відповідно їх можна використовувати для зберігання інформації. Недолік даного методу: легкість виявлення. Цифрова стеганографія Розвиток засобів цифрової обчислювальної техніки дав поштовх для розвитку комп'ютерної стеганографії, яка ґрунтується на вбудовуванні секретного повідомлення в цифрові дані, що, як правило, мають аналогову природу (аудіозаписи, зображення, відео). Можливе також вбудовування інформації в текстові та скомпресовані файли. Цифрова стеганографія — напрям класичної стеганографії, заснований на захованні або впровадженні додаткової інформації в цифрові об'єкти, викликаючи при цьому деякі спотворення цих об'єктів. Але, як правило, дані об'єкти є мультимедіа-об'єктами (зображення, відео, аудіо, текстури 3D-об'єктів) та внесення спотворень, які знаходяться нижче межі чутливості середньостатистичної людини, не призводить до помітних змін цих об'єктів. Крім того, в оцифрованих об'єктах, тобто таких, що спочатку мають аналогову природу, завжди присутній шум квантування; також, при відтворенні цих об'єктів з'являється додатковий аналоговий шум і нелінійні спотворення апаратури, все це сприяє більшій непомітності прихованої інформації. Мережева стеганографія Останнім часом набули популярності методи, коли прихована інформація передається через комп'ютерні мережі з використанням особливостей роботи протоколів передачі даних. Такі методи одержали назву «мережна стеганографія». Цей термін вперше ввів Кжиштоф Щипьорский (Krzysztof Szczypiorski) в 2003 році. Типові методи мережевої стеганографії включають зміну властивостей одного з мережевих протоколів. Крім того, може використовуватися взаємозв'язок між двома або більше різними протоколами з метою більш надійного приховування передачі секретного повідомлення. Мережева стеганографія охоплює широкий спектр методів, зокрема: WLAN стеганографія ґрунтується на методах, які використовуються для передачі стеганограм в бездротових локальних мережах (Wireless Local Area Networks). Практичний приклад WLAN стеганографії — система HICCUPS (Hidden Communication System for Corrupted Networks). LACK стеганографія — приховування повідомлень під час розмов з використанням IP-телефонії. Наприклад: використання пакетів, що затримуються, або навмисно пошкоджуються та ігноруються приймачем (цей метод називають LACK — Lost Audio Packets Steganography), або приховування інформації в полях заголовку, які не використовуються. DAB- і DVB стеганографія — стеганографічна обробка інформації, що циркулює у мережах цифрового звукового і/або телевізійного мовлення. VoIP (англ. voice over IP) — технологія передачі медіа даних в реальному часі за допомогою сімейства протоколів TCP/IP. IP-телефонія — система зв'язку, при якій аналоговий звуковий сигнал від одного абонента дискретизується (кодується в цифровий вигляд), компресується і пересилається по цифрових каналах зв'язку до іншого абонента, де проводиться зворотна операція — декомпресія, декодування і відтворення. Розмова відбувається у формі аудіо-потоків за допомогою протоколів RTP (Real-Time Transport Protocol) LACK — це метод стеганографії для IP-телефонії, який модифікує пакети з голосовим потоком. Він використовує те, що в типових мультимедійних комунікаційних протоколах, таких як RTP, надмірно затримані пакети вважаються приймачем марними і відкидаються. Принцип функціонування LACK виглядає наступним чином. Передавач (Аліса) вибирає один з пакетів з голосового потоку і його корисне навантаження замінює бітами таємного повідомлення — стеганограмою, яка вбудовується в пакет. Потім обраний пакет навмисно затримується. Кожного разу, коли надмірно затриманий пакет досягає отримувача, незнайомого з стеганографічною процедурою, він відкидається. Однак, якщо отримувач (Боб) знає про прихований зв'язок, то замість видалення отриманих RTP пакетів, він вилучає приховану інформацію "
        }
    }

    Column {
        spacing: 1

        Controls2.TextArea {
            id: _text
            width: _root.width
            placeholderText: _groupBox.activeAction === "Зашифрувати" ? "Введіть текст" : "Результат"
            readOnly: _repeater.count !== 1
            background: Rectangle {
                color: "grey"
            }

            onEditingFinished: {
                _text.text = data
            }
        }

        Row {
            spacing: 2
            Controls1.GroupBox {
                id: _groupBox
                property string activeAction: _encode.action
                signal actionChaged()
                RowLayout {
                    Controls1.ExclusiveGroup {
                        id: tabPositionGroup

                        onCurrentChanged: {
                            console.log("change", tabPositionGroup.current.action)
                            _groupBox.activeAction = tabPositionGroup.current.action
                            _groupBox.actionChaged()
                        }
                    }

                    Controls1.RadioButton {
                        readonly property string action: "Зашифрувати"
                        id: _encode
                        checked: true
                        exclusiveGroup: tabPositionGroup
                        style: RadioButtonStyle {
                            label: Text {
                                text: _encode.action
                                color: "black"
                            }
                        }

                        Component.onCompleted: {
                            console.log("text")
                        }
                    }
                    Controls1.RadioButton {
                        readonly property string action: "Розшифрувати"
                        id: _decode
                        exclusiveGroup: tabPositionGroup
                        style: RadioButtonStyle {
                            label: Text {
                                text: _decode.action
                                color: "black"
                            }
                        }
                    }
                }

                onActionChaged: {
                    _text.text = ""
                }
            }

            Controls2.Button {
                text: "Виконати"
                height: _groupBox.height

                onPressed: {
                    if(_groupBox.activeAction === "Зашифрувати")
                        _root.trigger(_groupBox.activeAction, _repeater.itemAt(0).filePath, _text.text)
                    else
                         _text.text = _root.trigger(_groupBox.activeAction, _repeater.itemAt(0).filePath, _repeater.itemAt(1).filePath)
                }
            }

            Controls2.Button {
                text: "Теорія"
                height: _groupBox.height

                onPressed: {
                    _loader.sourceComponent = _theory
                }
            }
        }

        Row {
            spacing: 1
            Repeater{
                id: _repeater
                model: createModel(_groupBox.activeAction === "Зашифрувати" ? 1 : 2)

                DragAndDropArea {
                    height: _root.height
                    width: _root.width / _repeater.count
                    text: modelData
                }
            }
        }
    }
}
