import QtQuick 2.0
import QtQuick.Window 2.15

Window {
    property string text
    id: _root
    visible: true

    height: 400
    width: 500

    Text {
        id: _text
        textFormat: Text.RichText
        text: _root.text
//        text: "\tШифр Цезаря або шифр зсуву — симетричний моноалфавітний алгоритм шифрування, в якому кожна буква відкритого тексту заміняється на ту, що віддалена від неї в алфавіті на сталу кількість позицій.
//\n\tЯк і будь-який моноалфавітний шифр, Цезарів вразливий до частотного криптоаналізу. Навіть легше зламати його простим перебором, бо кількість можливих ключів зовсім невелика — для українського алфавіту 32 варіанти.
//\n\tМетод Цезаря не надає майже ніякого криптографічного захисту, але він ліг в основу дещо складніших алгоритмів. Принцип дії
//\n\tПринцип дії полягає в тому, щоб циклічно зсунути алфавіт, а ключ — це кількість літер, на які робиться зсув.y=(x+k) mod n
//\n\tПриклад\n
//\n\tПрипустимо, що, використовуючи шифр Цезаря, з ключем, який дорівнює 3, необхідно зашифрувати словосполучення «ШИФР ЦЕЗАРЯ».
//\n\tДля цього зрушимо алфавіт так, щоб він починався з четвертої букви (Г). Отже, беручи вихідний алфавіт
//\n\tАБВГҐДЕЄЖЗИІЇЙКЛМНОПРСТУФХЦЧШЩЬЮЯ, і зміщуючи всі літери вліво на 3, отримуємо відповідність:
//\n\tА Б В Г Ґ Д Е Є Ж З И І Ї Й К Л М Н О П Р С Т У Ф Х Ц Ч Ш Щ Ь Ю Я
//\n\tГ Ґ Д Е Є Ж З И І Ї Й К Л М Н О П Р С Т У Ф Х Ц Ч Ш Щ Ь Ю Я А Б В,
//\n\tде Г=А, Д=В, Е=Г, і т. д.
//\n\tВикористовуючи цю схему, відкритий текст «ШИФР ЦЕЗАРЯ» перетворюється на «ЮЙЧУ ЩЗЇГУВ». Для того, щоб одержувач повідомлення міг відновити вихідний текст, необхідно повідомити йому, що ключ — 3.
//\n\tКриптоаналіз
//\n\tШифр Цезаря має замало ключів — на одиницю менше, ніж літер в абетці. Тому його легко зламати перебором — пробувати усі можливі ключ, поки розшифрування не дасть впізнаваний відкритий текст.
//\n\tТакож зламати шифр Цезаря можна, як і звичайний підстановочний шифр, у зв'язку з тим, що частота появи кожної літери в шифртексті збігається з частотою появи у відкритому тексті.
//\n\tЯкщо припустити, що частота появи літер у відкритому тексті приблизно відповідає середньостатистичній відносній частоті появи літер в текстах мови, якою написане повідомлення, \n\tтоді ключ знаходиться зіставленням перших декількох літер, що трапляються найчастіше у відкритому та зашифрованому текстах. Тобто за допомогою методу частотного криптоаналізу."//"Normal<sub> Subscript</sub> <sup>Superscript</<sup>"

//    text: "Шифр Віженера (фр. Chiffre de Vigenère) - метод поліалфавітного шифрування літерного тексту з використанням ключового слова.\n
//Опис
//У шифрі Цезаря кожна буква алфавіту зсувається на кілька позицій; наприклад в шифрі Цезаря при зсуві +3, A стало б D, B стало б E і так далі. Шифр Віженера складається з послідовності декількох шифрів Цезаря з різними значеннями зсуву.\nДля зашифровування може використовуватися таблиця алфавітів, названа tabula recta або квадрат (таблиця) Віженера. Стосовно до латинському алфавіту таблиця Віженера складається з рядків по 26 символів, причому кожний наступний рядок зсувається на кілька позицій.
//\nТаким чином, в таблиці виходить 26 різних шифрів Цезаря. На кожному етапі шифрування використовуються різні алфавіти, які обираються в залежності від символу ключового слова. Наприклад, припустимо, що вихідний текст має такий вигляд: ATTACKATDAWN
//Людина, яка посилає повідомлення, записує ключове слово ( «LEMON») циклічно доти, поки його довжина не буде відповідати довжині вихідного тексту: LEMONLEMONLE
//Перший символ вихідного тексту A зашифрований послідовністю L, яка є першим символом ключа. Перший символ L шифрованого тексту знаходиться на перетині рядка L і стовпці A в таблиці Віженера.
//Точно так же для другого символу вихідного тексту використовується другий символ ключа; тобто другий символ шифрованого тексту X виходить на перетині рядка E і стовпці T. Інша частина вихідного тексту шифрується подібним способом.
//Розшифрування проводиться таким чином: знаходимо в таблиці Віженера рядок, відповідну першому символу ключового слова; в цьому рядку знаходимо перший символ зашифрованого тексту.
//Стовпець, в якому знаходиться даний символ, відповідає першому символу вихідного тексту.
//Криптоаналіз
//Шифр Віженера «розмиває» характеристики частот появи символів у тексті, але деякі особливості появи символів в тексті залишаються.
//Головний недолік шифру Віженера полягає в тому, що його ключ повторюється. Тому простий криптоаналіз шифру може бути побудований в два етапи:
//1. Пошук довжини ключа. Можна аналізувати розподіл частот в зашифрованому тексті з різним проріджуванням. Тобто брати текст, що включає кожну 2-у букву зашифрованого тексту, потім кожну 3-ю і т. д.
//Як тільки розподіл частот букв буде сильно відрізнятися від рівномірного (наприклад, по ентропії), то можна говорити про знайдену довжині ключа.
//2. Криптоаналіз. Сукупність l шифрів Цезаря (де l - знайдена довжина ключа), які окремо легко зламуються.
//Тести Фрідмана і Касіскі можуть допомогти визначити довжину ключа"


    } // Text

} // Rectangle
